#================================================
# 요구사항
#================================================
# R을 이용한 임금과 노동시간의 회귀분석 (산포도, 추세선, 회귀식)

# 임금(wage)과 노동시간(hours)의 산포도와 추세선 그리기
# 노조가입 여부(union)에 따른 산포도와 추세선 그리기 및 분석
# 노동시간에 대한 임금탄력성 회귀분석
# 노조가입 여부에 따른 임금탄력성 추정 및 차이점 분석

# ================================================
# 비즈니스 로직 수행
# ================================================
# 라이브러리 읽기
library(tidyverse)
library(lmtest)


# 데이터 불러오기
data = readr::read_csv('nlsw88.csv')

# 노조가입 여부 변수 변환 (이진 변수로)
dataL1 = data %>% 
  na.omit()

# ==============================================================================
# 임금(wage)과 노동시간(hours)의 산포도와 추세선 그리기
# ==============================================================================
# 임금과 노동시간의 산포도 및 추세선
ggplot(dataL1, aes(x=hours, y=wage)) +
  geom_point() +
  geom_smooth(method='lm', formula=y~x) +
  ggtitle('임금 대 노동시간 산포도 및 추세선') +
  xlab('노동시간') +
  ylab('임금')


# ==============================================================================
# 노조가입 여부(union)에 따른 산포도와 추세선 그리기
# ==============================================================================
# 노조가입 여부에 따른 산포도 및 추세선
ggplot(dataL1, aes(x=hours, y=wage, color=union)) +
  geom_point() +
  geom_smooth(method='lm', formula=y~x) +
  ggtitle('노조가입 여부에 따른 임금 대 노동시간 산포도 및 추세선') +
  xlab('노동시간') +
  ylab('임금')


# ==============================================================================
# 노동시간의 임금탄력성 회귀분석
# ==============================================================================
# 회귀분석
model = lm(wage ~ hours, data=data)
summary(model)

# ==============================================================================
# 노조가입 여부에 따른 임금탄력성 추정
# ==============================================================================
# 노조와 비노조 그룹 별 회귀분석
union_model = lm(wage ~ hours, data=data, subset=union=='Yes')
nonunion_model <- lm(wage ~ hours, data=data, subset=union=='No')

# 결과 요약
summary(union_model)
summary(nonunion_model)
